app/controllers/songs_controller.rb

SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 1]]
SELECT "songs".* FROM "songs"
---
  def index
    #@songs = Song.all
    #allow the songs#index and songs#show actions to handle a valid song for the artist
    #in the songs index action, if the artist cant be found, redirect to the index of artists, and set a flash[:alert]
    #if somone passes in the artist id to index (index/:id)
    #find the artist id by the id params if there is no artist id, then return the alert
    #else if there is an id, return the songs, else if there are no params or fileters, return all the songs
    if params[:artist_id]
      @artist = Artist.find_by(id: params[:artist_id])
      if @artist.nil?
        redirect_to artists_path, alert: "Artist not found"
      else
        @songs = @artist.songs
      end
    else
    @songs = Song.all

SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 2]]
SELECT  "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    #@song = Song.find(params[:id])
    #songs#show action, if the song cant be found for a given artist, redirect to the index of the artist's songs and set a flash[:alert]
    #alert of "Song not found"
    #show artist_id, if @song.nil, redirect again to the artist song path and alert song not found
    if params[:artist_id]
      @artist = Artist.find_by(id: params[:artist_id])
      @song = @artist.songs.find_by(id: params[:id])